In [1]:
import numpy as np
import pandas as pd

### JOINING 2 DATA FRAMES

In [2]:
students_df = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie'],
    'age': [20, 21, 22]
}, index=['S1', 'S2', 'S3'])
students_df

       name  age
S1    Alice   20
S2      Bob   21
S3  Charlie   22

In [3]:
marks_df = pd.DataFrame({
    'math': [85, 90, 88],
    'science': [78, 95, 89]
}, index=['S1', 'S2', 'S4'])
marks_df

    math  science
S1    85       78
S2    90       95
S4    88       89

In [4]:
students_df.join(marks_df)

       name  age  math  science
S1    Alice   20  85.0     78.0
S2      Bob   21  90.0     95.0
S3  Charlie   22   NaN      NaN

In [5]:
marks_df.join(students_df)

    math  science   name   age
S1    85       78  Alice  20.0
S2    90       95    Bob  21.0
S4    88       89    NaN   NaN

In [6]:
students_df.join(marks_df,how='inner')

     name  age  math  science
S1  Alice   20    85       78
S2    Bob   21    90       95

In [7]:
students_df.join(marks_df,how='outer')

       name   age  math  science
S1    Alice  20.0  85.0     78.0
S2      Bob  21.0  90.0     95.0
S3  Charlie  22.0   NaN      NaN
S4      NaN   NaN  88.0     89.0

In [8]:
students_df.join(marks_df,how='left')

       name  age  math  science
S1    Alice   20  85.0     78.0
S2      Bob   21  90.0     95.0
S3  Charlie   22   NaN      NaN

In [9]:
students_df.join(marks_df,how='right')

     name   age  math  science
S1  Alice  20.0    85       78
S2    Bob  21.0    90       95
S4    NaN   NaN    88       89